import React from "react";
import Headline from "../components/Headline";
import Paragraph from "../components/Paragraph";
import Title from "../components/Title";
import Subtitle from "../components/Subtitle";
import Wrapper from "../components/Wrapper";

const Terms = () => {
  return (
    <Wrapper>
      <Headline>Правила пользования</Headline>
      <Subtitle>
        Используя нашу услугу «Сканер уязвимостей», вы подтверждаете, что
        прочитали, поняли и согласились с настоящими Условиями. Благодарить вам
        за выбор AVSS!
      </Subtitle>
      <Title>1. Нормы</Title>
      <Paragraph>
        Используя Сканер уязвимостей, вы подтверждаете, что прочитали, поняли и
        согласны соблюдать настоящие Положения и условия. Мы оставляем за собой
        право изменять эти условия в любое время. Изменения будут вступают в
        силу сразу после публикации на этой странице. Ваше дальнейшее
        использование сервисом после любых таких изменений означает ваше
        согласие с новых условий.
      </Paragraph>
      <Title>2. Описание сервиса</Title>
      <Paragraph>
        Наш сканер уязвимостей предназначен для выявления и сообщения о
        потенциальных уязвимости безопасности в веб-приложениях. Услуга включает
        в себя автоматическое сканирование, подробные отчеты и рекомендации по
        исправление.
      </Paragraph>
      <Title>3. Ответственность пользователя</Title>
      <Paragraph>
        Вы соглашаетесь использовать Сканер уязвимостей только в законных целях
        и в соответствии с настоящими Условиями. Вы не должны:
      </Paragraph>
      <Paragraph>
        Используйте услугу в любых незаконных или несанкционированных целях.
      </Paragraph>
      <Paragraph>
        Попытка получить несанкционированный доступ к любой части службы или
        другим системы или сети, подключенные к услуге.
      </Paragraph>
      <Paragraph>
        Attempt to gain unauthorized access to any part of the service or other
        systems or networks connected to the service.
      </Paragraph>
      <Title>4. Регистрация аккаунтов</Title>
      <Paragraph>
        Чтобы использовать определенные функции нашего сервиса, вам может
        потребоваться создать счет. Вы несете ответственность за сохранение
        конфиденциальности вашей информацию об учетной записи и обо всех
        действиях, которые происходят под вашим счет. Вы соглашаетесь немедленно
        уведомить нас о любом несанкционированном использовании вашей учетной
        записи или любое другое нарушение безопасности.
      </Paragraph>
      <Title>5. Интеллектуальная собственность</Title>
      <Paragraph>
        Весь контент, функции и функциональные возможности Сканера уязвимостей,
        включая, помимо прочего, текст, графику, логотипы и программное
        обеспечение, является исключительной собственностью [Название вашей
        компании] или ее лицензиаров и являются защищены авторским правом,
        товарными знаками и другими законами об интеллектуальной собственности.
        Вы не имеете права воспроизводить, изменять, распространять или
        создавать производные работы любой контент без нашего явного письменного
        согласия.
      </Paragraph>
      <Title>6. Ограничение ответственности</Title>
      <Paragraph>
        Ни при каких обстоятельствах [Название вашей компании] не несет
        ответственности за любые косвенные, случайный, особый, косвенный или
        штрафной ущерб, возникший в результате или в связи с использованием вами
        Сканера уязвимостей. Наша общая сумма ответственность перед вами за
        любые претензии, вытекающие из настоящих Условий или использования вами
        услуга не может превышать сумму, уплаченную вами за услугу.
      </Paragraph>
      <Title>7. Отказ от гарантий</Title>
      <Paragraph>
        Сканер уязвимостей предоставляется на условиях «как есть» и «как
        доступно». основе. Мы не даем никаких гарантий, явных или
        подразумеваемых, в отношении работу службы или информации, контента,
        материалов или товары, включенные в услугу. В максимальной степени,
        разрешенной закону, мы отказываемся от всех гарантий, явных или
        подразумеваемых, включая, помимо прочего, ограничивается
        подразумеваемыми гарантиями коммерческой ценности и пригодности для
        особая цель.
      </Paragraph>
      <Title>8. Применимое право</Title>
      <Paragraph>
        Настоящие Условия регулируются и толкуются в соответствии с в
        соответствии с законами [Вашей юрисдикции]. Любые споры, возникающие вне
        или в связи с настоящими условиями или использованием вами услуги, будет
        решено в судах [Вашей юрисдикции].
      </Paragraph>
      <Title>9. Контактная информация</Title>
      <Paragraph>
        Если у вас есть какие-либо вопросы по поводу настоящих Положений и
        условий, пожалуйста, свяжитесь с нами по адресу: [Название вашей
        компании] [Ваш адрес] [Ваш адрес электронной почты] [Ваш номер телефона]
      </Paragraph>
      <Title>10. Изменения в настоящих Условияхs</Title>
      <Paragraph>
        Мы можем время от времени обновлять настоящие Условия. Мы будем
        уведомлять вас о любых изменениях, публикуя новые Условия на этой
        странице. Ты рекомендуется периодически просматривать настоящие Условия
        на предмет каких-либо изменений. Изменения в настоящие Условия вступают
        в силу с момента их публикации на этой странице.
      </Paragraph>
    </Wrapper>
  );
};

export default Terms;
